#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/eatthis-ch/eatthis-ch/runs/run-bLeRADJoHiTi5ano

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_domain.main will be created
  + resource "digitalocean_domain" "main" {
      + id   = (known after apply)
      + name = "eatthis.ch"
      + urn  = (known after apply)
    }

  # digitalocean_record.caa_eatthis_ch will be created
  + resource "digitalocean_record" "caa_eatthis_ch" {
      + domain = "eatthis.ch"
      + flags  = 0
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + tag    = "issue"
      + ttl    = (known after apply)
      + type   = "CAA"
      + value  = "letsencrypt.org."
    }

  # digitalocean_record.cname_docs_eatthis_ch will be created
  + resource "digitalocean_record" "cname_docs_eatthis_ch" {
      + domain = "eatthis.ch"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "docs.eatthis.ch."
      + ttl    = (known after apply)
      + type   = "CNAME"
      + value  = "eatthis-ch.github.io."
    }

  # digitalocean_record.cname_www_docs_eatthis_ch will be created
  + resource "digitalocean_record" "cname_www_docs_eatthis_ch" {
      + domain = "eatthis.ch"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "www.docs.eatthis.ch."
      + ttl    = (known after apply)
      + type   = "CNAME"
      + value  = "www.eatthis-ch.github.io."
    }

  # digitalocean_record.mx_eatthis_ch will be created
  + resource "digitalocean_record" "mx_eatthis_ch" {
      + domain   = "eatthis.ch"
      + fqdn     = (known after apply)
      + id       = (known after apply)
      + name     = "@"
      + priority = 0
      + ttl      = (known after apply)
      + type     = "MX"
      + value    = "s085.cyon.net."
    }

  # digitalocean_record.txt_eatthis_ch will be created
  + resource "digitalocean_record" "txt_eatthis_ch" {
      + domain = "eatthis.ch"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=spf1 include:spf.protection.cyon.net -all"
    }

  # module.terraform-digitalocean-doks.digitalocean_kubernetes_cluster.k8s will be created
  + resource "digitalocean_kubernetes_cluster" "k8s" {
      + auto_upgrade   = true
      + cluster_subnet = (known after apply)
      + created_at     = (known after apply)
      + endpoint       = (known after apply)
      + id             = (known after apply)
      + ipv4_address   = (known after apply)
      + kube_config    = (sensitive value)
      + name           = "eatthis-ch"
      + region         = "ams2"
      + service_subnet = (known after apply)
      + status         = (known after apply)
      + surge_upgrade  = true
      + tags           = [
          + "kubernetes",
        ]
      + updated_at     = (known after apply)
      + urn            = (known after apply)
      + version        = "1.21.2-do.2"
      + vpc_uuid       = (known after apply)

      + maintenance_policy {
          + day        = (known after apply)
          + duration   = (known after apply)
          + start_time = (known after apply)
        }

      + node_pool {
          + actual_node_count = (known after apply)
          + auto_scale        = true
          + id                = (known after apply)
          + labels            = {
              + "service" = "kubernetes"
            }
          + max_nodes         = 3
          + min_nodes         = 1
          + name              = "eatthis-ch-core"
          + node_count        = 1
          + nodes             = (known after apply)
          + size              = "s-2vcpu-4gb"
          + tags              = [
              + "kubernetes",
            ]
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @the-technat, Action: `pull_request`*